namespace Ferryman.UI.Components
{
    public static class GameText
    {

        public static readonly string Rules = " Крестьянину нужно перевезти через реку волка, козу и капусту.\n " +
            "Но лодка такова, что в ней может поместиться только крестьянин,\n " +
            "а с ним или один волк, или одна коза, или одна капуста.\n " +
            "Но если оставить волка с козой, то волк съест козу,\n " +
            "а если оставить козу с капустой, то коза съест капусту.\n " +
            "Как перевез свой груз крестьянин?";

        public static readonly string WinMessage = "Поздравляю! Вы победитель!\nВы помогли Крестьянину перевезти через реку волка, козу и капусту!";
    }
}
