using Ferryman.UI;

namespace Ferryman
{
    /*
     * 
        Крестьянину нужно перевезти через реку волка, козу и капусту. 
        Но лодка такова, что в ней может поместиться только крестьянин, а с ним или один волк, или одна коза, или одна капуста. 
        Но если оставить волка с козой, то волк съест козу, а если оставить козу с капустой, то коза съест капусту. 
        Как перевез свой груз крестьянин?

        Игра в виде консольного приложения

        - вывод задачи пользователю
        - вывод возможных действий
        - хранение данных

        Goat
        Wolf
        Cabbage

        Coast
     */

    class Program
    {       
        static void Main()
        {
            FirstMenu.OpenMenu();
        }
    }
}
